<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork865-2023-01-01">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [13]:
!pip3 install sqlalchemy==1.3.9

Requirement already satisfied: sqlalchemy==1.3.9 in c:\users\naruto\.conda\envs\newdl\lib\site-packages (1.3.9)

In [17]:
!pip install ibm_db_sa
!pip install ipython-sql

Collecting ibm_db_sa
  Downloading ibm_db_sa-0.4.0-py3-none-any.whl (31 kB)
Requirement already satisfied: sqlalchemy>=0.7.3 in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from ibm_db_sa) (1.3.9)
Collecting ibm-db>=2.0.0
  Downloading ibm_db-3.1.4.tar.gz (1.4 MB)
     ---------------------------------------- 1.4/1.4 MB 435.5 kB/s eta 0:00:00
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'done'
  Installing backend dependencies: started
  Installing backend dependencies: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Building wheels for collected packages: ibm-db
  Building wheel for ibm-db (pyproject.toml): started
  Building wheel for ibm-db (pyproject.toml): finished with status 'done'
  Created wheel for ibm-db: filename=ibm_db-3.1.4-py3-none-any.whl size=27751686 sha256=659f22b0b646f9e9f8cd85dd270b8e024cfc5d5e8d0cb3708e2cf5bf96639e46
  Stored in directory: c:\users\naruto\appdata\local\pip\cache\wheels\3a\be\7c\a9fba7b555faa36460971a8aa7dce3b283ec9b135be2e1e55e
Successfully built ibm-db
Installing collected packages: ibm-db, ibm_db_sa
Successfully installed ibm-db-3.1.4 ibm_db_sa-0.4.0
Collecting ipython-sql
  Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Requirement already satisfied: ipython-genutils in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from ipython-sql) (0.2.0)
Collecting prettytable
  Downloading prettytable-3.8.0-py3-none-any.whl (27 kB)
Requirement already satisfied: six in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from ipython-sql) (8.7.0)
Collecting sqlparse
  Downloading sqlparse-0.4.4-py3-none-any.whl (41 kB)
     --------------------------------------- 41.2/41.2 kB 38.8 kB/s eta 0:00:00
Collecting sqlalchemy>=2.0
  Downloading SQLAlchemy-2.0.17-cp39-cp39-win_amd64.whl (2.0 MB)
     ---------------------------------------- 2.0/2.0 MB 255.7 kB/s eta 0:00:00
Requirement already satisfied: greenlet!=0.4.17 in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.1)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.4.0)
Requirement already satisfied: backcall in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pygments>=2.4.0 in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: decorator in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.11 in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from ipython->ipython-sql) (3.0.36)
Requirement already satisfied: stack-data in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: traitlets>=5 in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: pickleshare in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: colorama in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: jedi>=0.16 in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: wcwidth in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: executing in c:\users\naruto\.conda\envs\newdl\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Installing collected packages: sqlparse, sqlalchemy, prettytable, ipython-sql
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.9
    Uninstalling SQLAlchemy-1.3.9:
      Successfully uninstalled SQLAlchemy-1.3.9
Successfully installed ipython-sql-0.5.0 prettytable-3.8.0 sqlalchemy-2.0.17 sqlparse-0.4.4

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [18]:
%load_ext sql

In [19]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [20]:
!pip install -q pandas==1.1.5

ERROR: Could not install packages due to an OSError: [WinError 5] Access is denied: 'C:\\Users\\NARUTO\\AppData\\Local\\Temp\\pip-uninstall-_8i6ir37\\_libs\\algos.cp39-win_amd64.pyd'
Consider using the `--user` option or check the permissions.

In [21]:
%sql sqlite:///my_data1.db

Traceback (most recent call last):
  File "C:\Users\NARUTO\.conda\envs\newDL\lib\site-packages\sql\connection.py", line 45, in __init__
    engine = sqlalchemy.create_engine(
  File "C:\Users\NARUTO\.conda\envs\newDL\lib\site-packages\sqlalchemy\engine\__init__.py", line 479, in create_engine
  File "C:\Users\NARUTO\.conda\envs\newDL\lib\site-packages\sqlalchemy\engine\strategies.py", line 61, in create
  File "C:\Users\NARUTO\.conda\envs\newDL\lib\site-packages\sqlalchemy\engine\url.py", line 172, in _get_entrypoint
  File "C:\Users\NARUTO\.conda\envs\newDL\lib\site-packages\sqlalchemy\util\langhelpers.py", line 239, in load
sqlalchemy.exc.NoSuchModuleError: Can't load plugin: sqlalchemy.dialects:sqlite

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])
Traceback (most recent call last):
  File "C:\Users\NARUTO\.conda\envs\newDL\lib\site-packages\sql\magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
  File "C:\Users\NARUTO\.conda\envs\newDL\lib\site-packages\sql\connection.py", line 70, in set
    cls.current = existing or Connection(descriptor, connect_args, creator)
  File "C:\Users\NARUTO\.conda\envs\newDL\lib\site-packages\sql\connection.py", line 45, in __init__
    engine = sqlalchemy.create_engine(
  File "C:\Users\NARUTO\.conda\envs\newDL\lib\site-packages\sqlalchemy\engine\__init__.py", line 479, in create_engine
  File "C:\Users\NARUTO\.conda\envs\newDL\lib\site-packages\sqlalchemy\engine\strategies.py", line 61, in create
  File "C:\Users\NARUTO\.conda\envs\newDL\lib\site-packages\sqlalchemy\engine\url.py", line 172, in _get_entrypoint
  File "C:\Users\NARUTO\.conda\envs\newDL\lib\site-packages\sqlalchemy\util\langhelpers.py", line 239, in load
sqlalchemy.exc.NoSuchModuleError: Can't load plugin: sqlalchemy.dialects:sqlite

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [45]:
import pandas as pd
df = pd.read_csv("Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")
df.head()

C:\Users\NARUTO\.conda\envs\newDL\lib\site-packages\pandas\core\generic.py:2605: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing_Outcome
0,06/04/2010,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0.0,LEO,SpaceX,Success,Failure (parachute)
1,12/08/2010,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0.0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,22/05/2012,7:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525.0,LEO (ISS),NASA (COTS),Success,No attempt
3,10/08/2012,0:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500.0,LEO (ISS),NASA (CRS),Success,No attempt
4,03/01/2013,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677.0,LEO (ISS),NASA (CRS),Success,No attempt

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [33]:
res = cur.execute("SELECT Launch_Site FROM SPACEXTBL group by Launch_Site")
res.fetchall()

[(None,),
 ('CCAFS LC-40',),
 ('CCAFS SLC-40',),
 ('KSC LC-39A',),
 ('VAFB SLC-4E',)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [40]:
res = cur.execute("SELECT * FROM SPACEXTBL where Launch_Site like 'CCA%' limit 5")
resDF=pd.DataFrame(res.fetchall())
resDF

,0,1,2,3,4,5,6,7,8,9
0,06/04/2010,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0.0,LEO,SpaceX,Success,Failure (parachute)
1,12/08/2010,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0.0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,22/05/2012,7:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525.0,LEO (ISS),NASA (COTS),Success,No attempt
3,10/08/2012,0:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500.0,LEO (ISS),NASA (CRS),Success,No attempt
4,03/01/2013,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677.0,LEO (ISS),NASA (CRS),Success,No attempt

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [44]:
query="select sum(payload_mass__kg_) from SPACEXTBL"
res = cur.execute(query)
resDF=pd.DataFrame(res.fetchall())
resDF

          0
0  619967.0

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [46]:
query="select avg(payload_mass__kg_) from SPACEXTBL where Booster_Version='F9 v1.1' "
res = cur.execute(query)
resDF=pd.DataFrame(res.fetchall())
resDF

        0
0  2928.4

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [58]:
query="select Date from SPACEXTBL where Landing_Outcome = 'Success (ground pad)' order by date limit 1"
res = cur.execute(query)
resDF=pd.DataFrame(res.fetchall())
resDF

            0
0  01/08/2018

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [61]:
query="select Booster_Version from SPACEXTBL where Landing_Outcome = 'Success (drone ship)' and PAYLOAD_MASS__KG_ between 4000 and 6000"
res = cur.execute(query)
resDF=pd.DataFrame(res.fetchall())
resDF

                0
0     F9 FT B1022
1     F9 FT B1026
2  F9 FT  B1021.2
3  F9 FT  B1031.2

### Task 7




##### List the total number of successful and failure mission outcomes

In [68]:
query="select Mission_Outcome,count(Mission_Outcome) from SPACEXTBL group by Mission_Outcome "
res = cur.execute(query)
resDF=pd.DataFrame(res.fetchall())
resDF

                                  0   1
0                              None   0
1               Failure (in flight)   1
2                           Success  98
3                          Success    1
4  Success (payload status unclear)   1

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [71]:
query="select Booster_Version from SPACEXTBL where PAYLOAD_MASS__KG_ in (select max(PAYLOAD_MASS__KG_)from SPACEXTBL) "
res = cur.execute(query)
resDF=pd.DataFrame(res.fetchall())
resDF

                 0
0    F9 B5 B1048.4
1    F9 B5 B1049.4
2    F9 B5 B1051.3
3    F9 B5 B1056.4
4    F9 B5 B1048.5
5    F9 B5 B1051.4
6    F9 B5 B1049.5
7   F9 B5 B1060.2
8   F9 B5 B1058.3
9    F9 B5 B1051.6
10   F9 B5 B1060.3
11  F9 B5 B1049.7

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [72]:
query="select substr(Date, 4, 2),Landing_Outcome,Booster_Version,launch_site from SPACEXTBL where substr(Date,7,4)='2015' "
res = cur.execute(query)
resDF=pd.DataFrame(res.fetchall())
resDF

    0                       1              2            3
0  10    Failure (drone ship)  F9 v1.1 B1012  CCAFS LC-40
1  11      Controlled (ocean)  F9 v1.1 B1013  CCAFS LC-40
2  02              No attempt  F9 v1.1 B1014  CCAFS LC-40
3  04    Failure (drone ship)  F9 v1.1 B1015  CCAFS LC-40
4  04              No attempt  F9 v1.1 B1016  CCAFS LC-40
5  06  Precluded (drone ship)  F9 v1.1 B1018  CCAFS LC-40
6  12    Success (ground pad)    F9 FT B1019  CCAFS LC-40

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [84]:
query="select Mission_Outcome,count(Mission_Outcome),date from SPACEXTBL  where date>='2010/06/04' and date>='2017/03/20' \
       group by Mission_Outcome order by date desc"
res = cur.execute(query)
resDF=pd.DataFrame(res.fetchall())
resDF

                     0   1           2
0  Failure (in flight)   1  28/06/2015
1             Success    1  23/12/2018
2              Success  30  22/05/2012

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>